//第一题: 通过代码, 完成如下需求:
//		1. 自定义一个人类，给出成员变量name和age.
//		2. 使用ArrayList集合存储人类对象并遍历.
//		3. 最后在控制台输出人类对象的成员变量值。
//		//格式为: 姓名: 张三, 年龄: 23
//		4. 通过四种方式遍历.
//		//提示: 普通迭代器, 增强for, 列表迭代器, 普通for
//
//		ArrayList<Student> list = new ArrayList<>();
//
//		第二题: 通过代码, 完成如下需求:
//		1. 自定义一个学生类，给出成员变量name和age.
//		2. 定义ArrayList集合, 用来存储学生对象.
//		3. 键盘录入3个学生的信息, 将他们封装成学生对象后, 添加到ArrayList集合中.
//		4. 判断集合中是否有姓名叫 刘亦菲 的学生, 如果有, 就往集合中添加学生对象: 糖糖, 18
//		5. 遍历集合. 	//用任意一种方式遍历即可.
//
//
//		第三题: 通过代码, 完成如下需求:
//		1. 自定义一个学生类，给出成员变量name和age.
//		2. 使用HashSet集合存储学生对象并遍历.
//		3. 最后在控制台输出学生对象的成员变量值。
//		//格式为: 姓名: 张三, 年龄: 23
//		4. 通过两种方式遍历.
//		//提示: 普通迭代器, 增强for.
//
//
//		第四题: 通过代码, 完成如下需求:
//		1. 编写一个程序, 获取10个 20~50 之间的随机数.  Math.random()
//		//包含20, 50
//		2. 要求随机数不能重复, 并将结果打印到控制台上.
//
//		第五题: 通过代码, 完成如下需求:
//		1. 定义方法getSum(), 用来获取n个整数的和.
//		2. 在main方法中调用getSum()方法.
//		3. 要求: 通过可变参数实现.
//
//
//		第六题: 通过代码, 完成如下需求:
//		1. 创建HashMap集合, 键是学号(String), 值是学生对象(Student).		//姓名, 年龄.
//		2. 往HashMap集合中添加3组数据.
//		3. 通过两种方式, 遍历HashMap集合.
//
//
//		第七题: 通过代码, 完成如下需求:
//		1. 创建HashMap集合, 键是学生对象(Student), 值是居住地(String).
//		2. 往HashMap集合中添加3组数据.
//		3. 通过两种方式, 遍历HashMap集合.
//
//
//		第八题: 通过代码, 完成如下需求:
//		1. 键盘录入一个字符串，要求统计字符串中每个字符串出现的次数。
//		2. 举例：键盘录入“aababcabcdabcde”  在控制台输出：“a(5)b(4)c(3)d(2)e(1)”
//
//
//		----------------------------------------------------------------------------------------------
////以下为扩展题:
//		第一题: 通过代码, 完成如下需求:
//		1. 定义ArrayList集合，存入多个字符串, 例如: "ab1", "123ad", "def", "bca", "def", "def", "dadfadf"  "dddaaa"  "你好啊"  "我来啦"  "别跑啊"
//		2. 遍历集合, 删除长度大于5的字符串, 打印删除后的集合对象
//		3. 基于上一步, 删除集合中所有的"def"字符串, 打印删除后的集合对象.
//
//
//		第二题: 通过代码, 完成如下需求:
//		1. 统计每个单词出现的次数
//		2. 有如下字符串"If you want to change your fate I think you must come to the dark horse to learn java"(用空格间隔)
//		3. 打印格式：
//		to=3
//		think=1
//		you=2
////........