//今日作业:
//	1. 通过for循环, 打印1~5之间的数字.
//	2. 通过for循环, 打印5~1之间的数字.
//	3. 求1-100之间的偶数和，并把求和结果打印到控制台上.
//	4. 获取到所有的水仙花数, 并将结果打印到控制台上.
//		/*
//			水仙花数解释
//				1.	水仙花数是一个3位数的整数.
//				2.	该数字的各个位数立方和相加等于它本身.
//				3.	例如: 153就是水仙花数, 153 = 1 * 1 * 1 + 5 * 5 * 5 + 3 * 3 * 3 = 153
//		*/
//	5. 统计所有水仙花数的个数, 并将其打印到控制台上.
//	6. 打印99乘法表.
//	7. 使用Math类，生成5个1~10之间的随机整数, 并将结果打印到控制台.
//
//扩展作业:  	//有时间做, 没有时间就尝试自习的时候写.
//	1. 猜数字的小游戏. 		//这个今天还没有讲到, 可以自己预习下尝试做一下, 写不出来也没关系, 明天详细讲.
//		1.1 生成一个1-100之间的随机数, 让用户来猜.
//		1.2 如果猜的数字比生成的随机数大，提示你猜的数据大了
//		1.3 如果猜的数字比生成的随机数小，提示你猜的数据小了
//		1.4 如果猜的数字与生成的随机数相等，提示恭喜你猜中了
//
//	2. 打印1-100之间所有的质数, 按照5个一行的格式输出, 格式如下:
//		2	3	5	7	11
//		13	17	19	23	29
//		31 ...
//		//额外提个要求, 可以尝试一下5行(包括)以内搞定这个需求.